mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
                        //                        anemometroDelayTest();
                        if (soundSpeed == 999.99) {
                            detect_delta_O = (float) DETECTION_ERROR_O;
                            detect_delta_E = (float) DETECTION_ERROR_E;
                            detect_delta_N = (float) DETECTION_ERROR_N;
                            detect_delta_S = (float) DETECTION_ERROR_S;
                        } else {
                            anemometroCalibCero(soundSpeed);
                        }

                        simpleMed.mag = detect_delta_O * 1000000;
                        simpleMed.deg = detect_delta_E * 1000000;
                        uartSendMed(simpleMed);

                        simpleMed.mag = detect_delta_N * 1000000;
                        simpleMed.deg = detect_delta_S * 1000000;
                        uartSendMed(simpleMed);
                        simpleMed.mag = 0;
                        simpleMed.deg = 0;

                        configOption = ExitConfig;
                        break;
                    case SetEmi:
                        configOption = uartGetModeConfig();
                        if (configOption == 1) emisorSelect = TRANS_EMISOR_NORTE;
                        if (configOption == 2) emisorSelect = TRANS_EMISOR_SUR;
                        if (configOption == 3) emisorSelect = TRANS_EMISOR_ESTE;
                        if (configOption == 4) emisorSelect = TRANS_EMISOR_OESTE;
                        configOption = ExitConfig;
                        break;
                    case SetPeriod:
                        configOption = uartGetModeConfig();
                        if (configOption == 1) medPeriod = 5;
                        if (configOption == 2) medPeriod = 10;
                        if (configOption == 3) medPeriod = 30;
                        if (configOption == 4) medPeriod = 60;
                        if (configOption == 5) medPeriod = 600;
                        configOption = ExitConfig;
                        break;
                    case ExitConfig:
                        anemometroModoActivo = Menu;
                        break;
                    default: anemometroModoActivo = Menu;
                }

                anemometroModoActivo = Menu;
                break;
            default: anemometroModoActivo = Menu;
        }
    }
}

void anemometroGetTmode(wind_medicion_type* modes, mux_transSelect_enum coordV) {
    float valMed = 0;
    float timeMed[] = {0, 0};
    float timeNmediciones[N_TIMER_MODE];
    uint8_t i = 0;
    uint8_t n = 0;
    float timeCorr[2];

    for (i = 0; i < 2; i++) {
        for (n = 0; n < N_TIMER_MODE; n++) {

            timeNmediciones[n] = anemometroGetCoordTime(coordV + i);

            vTaskDelay(1 / portTICK_PERIOD_MS);
        }
        anemometroCalcMode(timeNmediciones, &timeMed[i], N_TIMER_MODE);
    }
    //DEBUG: ajuste ventanas
    modes->mag = timeMed[0] * 1000000;
    modes->deg = timeMed[1] * 1000000;

    switch (coordV) {
        case TRANS_EMISOR_OESTE:
            sprintf(modes->coord, " O ");
            break;
        case TRANS_EMISOR_ESTE:
            sprintf(modes->coord, " E ");
            break;
        case TRANS_EMISOR_NORTE:
            sprintf(modes->coord, " N ");
            break;
        case TRANS_EMISOR_SUR:
            sprintf(modes->coord, " S ");
            break;
    }
}

float anemometroGetVcoord(mux_transSelect_enum coordV) {
    float valMed = 0;
    float timeMed[] = {0, 0};
    float timeNmediciones[N_TIMER_MODE];
    uint8_t i = 0;
    uint8_t n = 0;
    float timeCorr[2];

    for (i = 0; i < 2; i++) {
        for (n = 0; n < N_TIMER_MODE; n++) {

            timeNmediciones[n] = anemometroGetCoordTime(coordV + i);

            vTaskDelay(1 / portTICK_PERIOD_MS);
        }
        anemometroCalcMode(timeNmediciones, &timeMed[i], N_TIMER_MODE);
    }

    if (timeMed[0] == 0 || timeMed[1] == 0 || timeMed[0] > 100 || timeMed[1] > 100) {
        valMed = 666.66;
    } else {
        //Calculo 
        switch (coordV) {
            case TRANS_EMISOR_OESTE:
                //Corrijo los tiempos medidos
                timeCorr[0] = timeMed[0] - detect_delta_O; //taOE
                timeCorr[1] = timeMed[1] - detect_delta_E; //trOE

                if (timeCorr[0] == timeCorr[1]) {
                    return 0;
                }
                //Si los dos tiempos desfasan para el mismo lado la medicion carece de sentido
                //                if ((timeCorr[0] < DETECTION_CERO_MIN && timeCorr[1] < DETECTION_CERO_MIN) ||
                //                        (timeCorr[0] > DETECTION_CERO_MAX && timeCorr[1] > DETECTION_CERO_MAX)) {
                //                    return 555.55;
                //                }

                /*La definicion de las coordenadas es tal que si el viento sopla 
                 * DESDE el NORTE el angulo es 0°
                 *si sopla DESDE el OESTE el angulo es 90°
                 * El angulo va de 0° a 360°
                 */
                valMed = (((float) DISTANCE_EO / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_EO;
                valMed = (valMed - DETECT_OFFSET_OE) / DETECT_SCALING_OE;
                break;
            case TRANS_EMISOR_NORTE:
                //Corrijo los tiempos medidos
                timeCorr[0] = timeMed[0] - detect_delta_N;
                timeCorr[1] = timeMed[1] - detect_delta_S;

                if (timeCorr[0] == timeCorr[1]) {
                    return 0;
                }

                //                if ((timeCorr[0] < DETECTION_CERO_MIN && timeCorr[1] < DETECTION_CERO_MIN) ||
                //                        (timeCorr[0] > DETECTION_CERO_MAX && timeCorr[1] > DETECTION_CERO_MAX)) {
                //                    return 555.55;
                //                }

                valMed = (((float) DISTANCE_NS / 2) * (1 / timeCorr[0] - 1 / timeCorr[1])) - OFFSET_ERROR_NS;
                valMed = (valMed - DETECT_OFFSET_NS) / DETECT_SCALING_NS;
                break;
            default:
                valMed = 444.44;
        }
    }

    return valMed;
}

BaseType_t anemometroVmode(float* medOE, float* medNS, uint8_t Nmode) {
    BaseType_t modeState = pdFAIL;
    uint8_t medNmodeOE = Nmode;
    uint8_t medNmodeNS = Nmode;
    float velNmedicionesEO[N_MED_MODE];
    float velNmedicionesNS[N_MED_MODE];
    uint8_t n = 0;

    for (n = 0; n < N_MED_MODE; n++) {

        velNmedicionesEO[n] = anemometroGetVcoord(TRANS_EMISOR_OESTE);

        vTaskDelay(1 / portTICK_PERIOD_MS);

        velNmedicionesNS[n] = anemometroGetVcoord(TRANS_EMISOR_NORTE);


        vTaskDelay(1 / portTICK_PERIOD_MS);
    }
    modeState = anemometroCalcMode(velNmedicionesEO, medOE, N_MED_MODE);

    modeState *= anemometroCalcMode(velNmedicionesNS, medNS, N_MED_MODE);

    return modeState;
}

