mauro-medina10/dsPIC33F_FreeRTOS_Anemometro_v1/Demo/dsPIC33F_MPLAB/main.c
BaseType_t anemometroVprom(float* medOE, float* medNS, uint8_t Nprom) {
    float medAcumOE = 0;
    float medAcumNS = 0;
    uint8_t medNpromOE = Nprom;
    uint8_t medNpromNS = Nprom;
    uint8_t i = 0;
    float medCoordOE = 0;
    float medCoordNS = 0;

    for (i = 0; i < Nprom; i++) {
        medCoordOE = anemometroGetVcoord(TRANS_EMISOR_OESTE);

        vTaskDelay(1 / portTICK_PERIOD_MS);

        medCoordNS = anemometroGetVcoord(TRANS_EMISOR_NORTE);

        if (medCoordOE < 100) {
            medAcumOE += medCoordOE;
        } else {
            medNpromOE--;
        }
        if (
                medCoordNS < 100) {
            medAcumNS += medCoordNS;
        } else {
            medNpromNS--;
        }
    }

    if (medNpromOE > (Nprom / 2) && medNpromNS > (Nprom / 2)) {
        *medOE = medAcumOE / medNpromOE;
        *medNS = medAcumNS / medNpromNS;

        return pdPASS;
    } else {
        *medOE = 666.66;
        *medNS = 666.66;
    }

    return pdFAIL;
}

float anemometroGetCoordTime(mux_transSelect_enum coordTime) {
    float timeMed = 999.99;
    uint32_t ulNotificationValue;
    BaseType_t notifyStatus = pdFAIL;
    BaseType_t pulseDetected = pdFALSE;
    BaseType_t pulseCaptured = pdFALSE;

    if (anemometroMuxOutputSelect(coordTime) != pdTRUE) {
        return timeMed;
    }
    //Desactivo MUX 2
    MUX_INPUT_INH(1);

    DELAY_50uS;

    timerStart();

    comparadorPulseTrain_NObloq(TRAIN_PULSE_LENGTH);

    //Necesitaria esperar 400us
    DELAY_400uS;
    DELAY_100uS;
    DELAY_50uS;

    //Activo Mux 2
    MUX_INPUT_INH(0);

    timerStop();

    adc_start();

    pulseCaptured = dma_capturePulse(coordTime);

    //    adc_stop();

    if (pulseCaptured == pdPASS) {
        pulseDetected = dma_detectPulse(coordTime, &timeMed);

        timeMed += (((float) timerCount() / configCPU_CLOCK_HZ));

        if (pulseDetected == pdFAIL) timeMed = 888.77;

    } else {
        timeMed = 888.88;
    }

    return timeMed;
}

wind_medicion_type anemometroGetMed(void) {
    wind_medicion_type valMed = {0, 0};
    float VcoordOE = 0;
    float VcoordNS = 0;
    BaseType_t medResult = pdFAIL;

    //    //Mido en la coordenada O-E
    //    VcoordOE = anemometroGetMedProm(TRANS_EMISOR_OESTE, N_MED_PROM);
    //    //Mido en la coordenada N-S
    //    VcoordNS = anemometroGetMedProm(TRANS_EMISOR_NORTE, N_MED_PROM);
    //Tomo 10 promedios de cada coordenada 
    medResult = anemometroVprom(&VcoordOE, &VcoordNS, N_MED_PROM);

    //Calculo 
    //    valMed.mag = sqrtf(powf(VcoordOE, 2) + powf(VcoordNS, 2
    //    if (VcoordOE < 555 && VcoordNS < 555) {
    if (medResult == pdPASS) {

        valMed.mag = sqrtf(VcoordOE * VcoordOE + VcoordNS * VcoordNS);

        if (valMed.mag == 0) {
            valMed.deg = 0;
            sprintf(valMed.coord, "   ");
            return valMed;
        }

        //Correccion lineal de la medicion
        valMed.mag = (valMed.mag - MED_OFFSET) / MED_SCALING;

        if (VcoordNS != 0) {
            //Viento desde NorOeste: 0 < deg < 90
            if (VcoordOE > 0 && VcoordNS > 0) {
                valMed.deg = (180 / 3.14159) * atanf(VcoordOE / VcoordNS);
                if (valMed.deg < 20) {
                    sprintf(valMed.coord, " N ");
                } else if (valMed.deg > 70) {
                    sprintf(valMed.coord, " O ");
                } else {
                    sprintf(valMed.coord, "N-O");
                }
            }
            //Viento desde Sur: 90 < deg < 270
            if (VcoordNS < 0) {
                valMed.deg = (180 / 3.14159) * atanf(VcoordOE / VcoordNS) + 180;
                if (valMed.deg < 110) {
                    sprintf(valMed.coord, " O ");
                } else if (valMed.deg > 160 && valMed.deg < 200) {
                    sprintf(valMed.coord, " S ");
                } else if (valMed.deg > 250) {
                    sprintf(valMed.coord, " E ");
                } else {
                    if (valMed.deg < 180) {
                        sprintf(valMed.coord, "S-O");
                    } else {
                        sprintf(valMed.coord, "S-E");
                    }
                }
            }
            //Viento desde NorEste: 270 < deg < 360
            if (VcoordOE < 0 && VcoordNS > 0) {
                valMed.deg = (180 / 3.14159) * atanf(VcoordOE / VcoordNS) + 360;
                if (valMed.deg > 340) {
                    sprintf(valMed.coord, " N ");
                } else if (valMed.deg < 290) {
                    sprintf(valMed.coord, " E ");
                } else {
                    sprintf(valMed.coord, "N-E");
                }
            }
        } else if (VcoordOE > 0) {
            //Viento desde Oeste
            valMed.deg = 90;
            sprintf(valMed.coord, " O ");
        } else {
            //Viento desde Este
            valMed.deg = 270;
            sprintf(valMed.coord, " E ");
        }
        //Correccion lineal del angulo
        if (valMed.deg >= ANGLE_OFFSET) {
            valMed.deg = (valMed.deg - ANGLE_OFFSET) / ANGLE_SCALING;
        }
    } else {
        //Error lectura
        valMed.mag = 999.99;
        valMed.deg = 999.99;
        return valMed;
    }

    if (valMed.deg == 180) {
        sprintf(valMed.coord, " S ");
    } else if (valMed.deg == 0) {
        sprintf(valMed.coord, " N ");
    }

    return valMed;
}

void anemometroTdetectedFromISR(BaseType_t * pxHigherPriorityTaskWoken, uint32_t val) {
    xTaskNotifyFromISR(xTaskToNotify, val, eSetBits, pxHigherPriorityTaskWoken);
}

void anemometroEmiterSelect(mux_transSelect_enum transd) {

    anemometroMuxOutputSelect(transd);

    //    adc_transdSelect(transd);
}

void anemometroSendFloat(float* dat) {
    xQueueSend(qRecf, dat, portMAX_DELAY);
}

void anemometroRecvFloat(float* dat) {
    xQueueReceive(qRecf, dat, portMAX_DELAY);
}

void anemometroReceptorDelay(mux_transSelect_enum emisor) {
    switch (emisor) {
        case TRANS_EMISOR_OESTE:
            DELAY_O;
            break;
        case TRANS_EMISOR_ESTE:
            DELAY_E;
            break;
        case TRANS_EMISOR_NORTE:
            DELAY_N;
            break;
        case TRANS_EMISOR_SUR:
            DELAY_S;

            break;
        default: DELAY_N;
    }
}

/*Configura los pines de salida del PORTA: RA1 = A y RA0 = B*/
BaseType_t anemometroMuxOutputSelect(mux_transSelect_enum ch) {
    switch (ch) {
        case TRANS_EMISOR_OESTE:
            MUX_INPUT_A(0);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(0);
            break;
        case TRANS_EMISOR_ESTE:
            MUX_INPUT_A(1);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(0);
            break;
        case TRANS_EMISOR_NORTE:
            MUX_INPUT_A(0);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(1);
            break;
        case TRANS_EMISOR_SUR:
            MUX_INPUT_A(1);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(1);
            break;
        default:
            MUX_INPUT_A(0);
            DELAY_50uS;
            //            vTaskDelay(20 / portTICK_PERIOD_MS);
            MUX_INPUT_B(0);
            break;
    }
    DELAY_50uS;
    //    vTaskDelay(20 / portTICK_PERIOD_MS);

    return pdTRUE;
}

BaseType_t anemometroCalcMode(float* pData, float* pMode, uint16_t nData) {
    float c[N_TIMER_MODE];
    uint8_t i, j;

    if (nData > N_TIMER_MODE) return pdFAIL;

    //Inicializo matriz auxiliar
    for (i = 0; i < N_TIMER_MODE; i++) {
        c [ i ] = 0;
    }
    /* Comparo cada elemento de los datos
     * si uno se repite cuento en el mismo indice de la matriz auxiliar
     * y borro de los datos el segundo de los elementos repetidos
     */
    for (i = 0; i < nData; i++) {
        for (j = 0; j < nData; j++) {
            if ((*(pData + i) == *(pData + j)) && (i != j) && (*(pData + i) != 0)) {
                c [ i ] += 1;
                *(pData + j) = 0;
            }
        }
    }

    i = 0;

    /* Recorro la matriz auxiliar
     * el indice con el numero mas alto sera el indice de la moda (i)
     */
    for (j = 0; j < nData; j++) {
        if (c[i] > c[j] && (i != j)) {
            c[j] = 0;
        } else if (i != j) {
            c[i] = 0;
            i = j;
        }
    }

    *pMode = *(pData + i);

    return pdPASS;
}

void anemometroCalibCero(float Sspeed) {
    float ceroMed[N_TIMER_MODE];
    uint8_t i = 0, j = 0;
    float ceroMode[4];

    for (j = 0; j < 4; j++) {
        for (i = 0; i < N_TIMER_MODE; i++) {

            ceroMed[i] = anemometroGetCoordTime((mux_transSelect_enum) j);
            vTaskDelay(10 / portTICK_PERIOD_MS);
        }
        //Mido el tiempo de pulso sin viento para cada coordenada
        anemometroCalcMode(ceroMed, &ceroMode[j], N_TIMER_MODE);
    }
    detect_delta_O = (float) ceroMode[0] - DISTANCE_EO / Sspeed;
    detect_delta_E = (float) ceroMode[1] - DISTANCE_EO / Sspeed;
    detect_delta_N = (float) ceroMode[2] - DISTANCE_NS / Sspeed;
    detect_delta_S = (float) ceroMode[3] - DISTANCE_NS / Sspeed;
}

